Tasks/ПодготовкаПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>ПодготовкаПроекта</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторСоздания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайняяДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбъектыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Наблюдатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наблюдатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Enums/ОбъектыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОбъектыЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВедущийКонструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнитьКартуПроектаДиз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнитьКартуПроектаКон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнениеДлительностиПроизводства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполненияДлительностиМонтажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовитьОзнакомительныйВыезд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверятьГабаритныеЧерчежи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительЗамера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьЗапускВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьКартуПроектаДиз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьКартуПроектаКон</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПриложенияКДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПриложенияКДоговорам</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийЗапасВНеделях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокМонтажаВНеделях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОкончанияМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОкончанияПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОкончанияПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПроектированияВНеделях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПроизводстваВНеделях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияЗаказчика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеЗаказчика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияЗаказчика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УслугиПриложенияДоговора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УслугаПриложенияДоговора</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиПриложенияДоговора</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НазначениеАвтораДляЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НазначениеАвтораДляЗадачи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбъектыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Tasks/ПодготовкаПроекта/Ext/ManagerModule.bsl
Функция СоздатьЗадачуПоПараметрам(стДанные) Экспорт

	НоваяЗадача = Задачи.ПодготовкаПроекта.СоздатьЗадачу();
	ЗаполнитьЗначенияСвойств(НоваяЗадача, стДанные);

	НоваяЗадача.Записать();
	
КонецФункции // создатьЗадачу()

Функция ПолучитьСтруктуруДляСозданияЗадачи(ПриложениеКДоговору, ТипЗадачи, Назначение = Неопределено, Основание = Неопределено) Экспорт

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриложенияКДоговорам.Проект КАК Проект,
		|	ПриложенияКДоговорам.Проект.Наименование КАК ПроектНаименование
		|ИЗ
		|	Справочник.ПриложенияКДоговорам КАК ПриложенияКДоговорам
		|ГДЕ
		|	ПриложенияКДоговорам.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПриложениеКДоговору);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Проект 				= Неопределено;
	ПроектНаименование 	= Неопределено;
	
	Пока Выборка.Следующий() Цикл
		Проект 				= Выборка.Проект;
		ПроектНаименование 	= Выборка.ПроектНаименование;
	КонецЦикла;
	
	стНазначение = Неопределено;
	
	стДанные = Новый Структура();
	стДанные.Вставить("ТипЗадачи", 				ТипЗадачи);
	стДанные.Вставить("Исполнитель", 			Справочники.НазначениеАвтораДляЗадачи.ПолучитьАвтораДляЗадачи(Проект, ТипЗадачи, стНазначение));
	стДанные.Вставить("Дата", 					ТекущаяДата());
	стДанные.Вставить("КрайняяДатаИсполнения", 	стДанные.Дата + 24 * 3600 * стНазначение.Продолжительность);
	стДанные.Вставить("Проект", 				Проект);
	стДанные.Вставить("ПриложениеКДоговору", 	ПриложениеКДоговору);
	стДанные.Вставить("Назначение", 			Назначение);
	стДанные.Вставить("Основание", 				Основание);
	стДанные.Вставить("АвторСоздания", 			ПараметрыСеанса.ТекущийПользователь);
	стДанные.Вставить("Наименование", 			Строка(ТипЗадачи) + " " + ПроектНаименование);
	стДанные.Вставить("Комментарий", 			"");
	
	Возврат стДанные;

КонецФункции // ПолучитьСтруктуруДляСозданияЗадачи()

  
Процедура СоздатьЗадачиПоЗаполнению(Проект, мСсылкиКомплекты, Основание) Экспорт

	КоличествоКомплектов = мСсылкиКомплекты.Количество();
	
	Если КоличествоКомплектов = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	ТипСтрокойПроизводства 	= " срок производства"; 
	ТипСтрокойМонтаж 		= " срок монтажа";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК Комплект,
		|	ИзделияКомплект.Наименование КАК КомплектНаименование
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", мСсылкиКомплекты);
	
	тзКомплектСНаименованием = Запрос.Выполнить().Выгрузить();
	
	тзСозданныеЗадачи = ПолучитьСозданныеЗадачи(мСсылкиКомплекты, Основание);
	стОтборСозданных = Новый Структура("ТипЗадачи, Комплект", );
	
	стПараметрыМонтаж 		= Задачи.ПодготовкаПроекта.ПолучитьСтруктуруДляСозданияЗадачи(Проект, Перечисления.ОбъектыЗадач.ЗаполненияДлительностиМонтажа, 		, Основание);
	стПараметрыПроизводства = Задачи.ПодготовкаПроекта.ПолучитьСтруктуруДляСозданияЗадачи(Проект, Перечисления.ОбъектыЗадач.ЗаполнениеДлительностиПроизводства, , Основание);
	
	Для х = 0 по КоличествоКомплектов - 1 Цикл
		
		стКомплект = тзКомплектСНаименованием[х];
		
		стОтборСозданных.Комплект 	= стКомплект.Комплект;
		стОтборСозданных.ТипЗадачи 	= Перечисления.ОбъектыЗадач.ЗаполненияДлительностиМонтажа;
		
		Если тзСозданныеЗадачи.НайтиСтроки(стОтборСозданных).Количество() = 0 Тогда
			
			стПараметрыМонтаж.Наименование 	= СтрШаблон("%1 %2", стКомплект.КомплектНаименование, ТипСтрокойМонтаж);
			стПараметрыМонтаж.Назначение 	= стКомплект.Комплект;
			
			Задачи.ПодготовкаПроекта.СоздатьЗадачуПоПараметрам(стПараметрыМонтаж);
			
		КонецЕсли;
		
		стОтборСозданных.ТипЗадачи 	= Перечисления.ОбъектыЗадач.ЗаполнениеДлительностиПроизводства;
		
		Если тзСозданныеЗадачи.НайтиСтроки(стОтборСозданных).Количество() = 0 Тогда
			
			стПараметрыПроизводства.Наименование 	= СтрШаблон("%1 %2", стКомплект.КомплектНаименование, ТипСтрокойПроизводства);
			стПараметрыПроизводства.Назначение 		= стКомплект.Комплект;
			
			Задачи.ПодготовкаПроекта.СоздатьЗадачуПоПараметрам(стПараметрыПроизводства);
			
		КонецЕсли;
		
	КонецЦикла;                                                             
	
КонецПроцедуры

Функция ПолучитьСозданныеЗадачи(мКомплекты, Основание)

	мТипыЗадач 		= Новый Массив(2);
	мТипыЗадач[0] 	= Перечисления.ОбъектыЗадач.ЗаполненияДлительностиМонтажа;
	мТипыЗадач[1] 	= Перечисления.ОбъектыЗадач.ЗаполнениеДлительностиПроизводства;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодготовкаПроекта.ТипЗадачи КАК ТипЗадачи,
		|	ПодготовкаПроекта.Назначение КАК Комплект
		|ИЗ
		|	Задача.ПодготовкаПроекта КАК ПодготовкаПроекта
		|ГДЕ
		|	ПодготовкаПроекта.Назначение В(&Назначение)
		|	И ПодготовкаПроекта.Основание = &Основание
		|	И ПодготовкаПроекта.ТипЗадачи В(&ТипЗадачи)";
	
	Запрос.УстановитьПараметр("Назначение", мКомплекты);
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("ТипЗадачи", мТипыЗадач);
	
	Возврат Запрос.Выполнить().Выгрузить();
	

КонецФункции // ПолучитьСозданныеЗадачи()
